result_not_consolidated/4core_4iothread/sysbench_5threads/delay_0/run3.txt
# run=3/5
# 2026-04-09T14:16:49+09:00

# cmd: taskset -c 4-15 ./bin/sysbench ./share/sysbench/oltp_read_write.lua
           --mysql-host=localhost
           --mysql-port=3306
           --mysql-user=sbuser
           --mysql-password=password
           --mysql-db=sbtest
           --tables=1
           --table_size=100
           --threads=5
           --time=60
           --rand-type=pareto
           --histogram=off
           run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 5
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            384916
        write:                           109161
        other:                           54686
        total:                           548763
    transactions:                        27192  (453.02 per sec.)
    queries:                             548763 (9142.49 per sec.)
    ignored errors:                      302    (5.03 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      453.0235
    time elapsed:                        60.0234s
    total number of events:              27192

Latency (ms):
         min:                                    1.67
         avg:                                   11.03
         max:                                 2438.51
         95th percentile:                       52.89
         sum:                               299993.99

Threads fairness:
    events (avg/stddev):           5438.4000/14.72
    execution time (avg/stddev):   59.9988/0.00